W10D4/RedditClone/reddit_clone/app/views/posts/edit.html.erb

SELECT "subs".* FROM "subs"
---
    <br>
        <% Sub.all.each do |sub| %>