W10D1/Capybara_hw/app/views/tracks/_form.html.erb

SELECT "albums".* FROM "albums"
---
    <option <%= track.id.nil? ? "selected" : "" %>>--Select a album--</option>
    <% Album.all.each do |album| %>