W9D3/ninety_nine_cats/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)

    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["birth_date", "2019-07-23"], ["color", "black"], ["name", "Catty McCatFace"], ["sex", "M"], ["created_at", "2019-07-24 22:19:42.479614"], ["updated_at", "2019-07-24 22:19:42.479614"]]

  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["birth_date", "1988-04-10"], ["description", "Misses Heavy Weapons Guy!"], ["updated_at", "2019-07-24 23:16:51.596960"], ["id", 3]]