W9D5/music_app/app/controllers/albums_controller.rb

    def create
        @album = Album.new(album_params)
        if @album.save
---
INSERT INTO "albums" ("title", "year", "band_id", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Test album"], ["year", 1992], ["band_id", 1], ["live", "live"], ["created_at", "2019-07-26 22:11:53.405042"], ["updated_at", "2019-07-26 22:11:53.405042"]]

    def update
        @album = Album.find(params[:id])
        if @album.update_attributes(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "Test album2"], ["updated_at", "2019-07-26 22:12:43.100689"], ["id", 1]]

    def destroy
        album = Album.find(params[:id])
        album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 1]]