W10D4/RedditClone/reddit_clone/app/views/subs/edit.html.erb

SELECT "users".* FROM "users"
---
        <option> --Select Moderator</option>
        <% User.all.each do |user| %>