W10D4/RedditClone/reddit_clone/app/views/subs/new.html.erb

SELECT "users".* FROM "users"
---
        <option selected> --Select Moderator</option>
        <% User.all.each do |user| %>