W9D5/music_app/app/views/albums/_form.html.erb

    <option <%= album.id.nil? ? "selected" : "" %>>--Select a band--</option>
    <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"