W10D4/RedditClone/reddit_clone/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Postme"], ["url", "asdas"], ["content", "12312"], ["sub_id", 1], ["author_id", 1], ["created_at", "2019-08-01 21:51:26.482919"], ["updated_at", "2019-08-01 21:51:26.482919"]]

  def update
    @post = Post.find(params[:id])

    if @post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "url" = $2, "content" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["title", "Postme12312"], ["url", "asdassadas"], ["content", "12312asdas"], ["updated_at", "2019-08-01 22:10:05.208469"], ["id", 1]]