W10D4/RedditClone/reddit_clone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Test"], ["description", "Whatever"], ["moderator_id", 1], ["created_at", "2019-08-01 20:12:09.715941"], ["updated_at", "2019-08-01 20:12:09.715941"]]
---
  def create
    @sub = Sub.new(sub_params)

    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "Test213"], ["description", "Whateversadas"], ["updated_at", "2019-08-01 20:30:58.227152"], ["id", 1]]
---
  def update
    @sub = Sub.find(params[:id])

    if @sub.update_attributes(sub_params)