W9D5/music_app/app/views/bands/show.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]
---
    <ul>
    <% @band.albums.each do |album| %>