W10D1/Capybara_hw/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Test2"], ["updated_at", "2019-07-26 21:06:44.414964"], ["id", 1]]
---
    def update
        @band = Band.find(params[:id])
        if @band.update_attributes(band_params)