W10D1/Capybara_hw/app/controllers/tracks_controller.rb

    def create
        @track = Track.new(track_params)
        if @track.save
---
INSERT INTO "tracks" ("title", "ord", "lyrics", "album_id", "regular", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "test song"], ["ord", 1], ["lyrics", ""], ["album_id", 2], ["regular", "regular"], ["created_at", "2019-07-26 23:22:56.095456"], ["updated_at", "2019-07-26 23:22:56.095456"]]

    def destroy
        track = Track.find(params[:id])
        track.destroy
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 1]]